#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrimLog/dev/runs/run-19uNQxLevoGPnQXX

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_iam_policy.fargate_policy: Refreshing state... [id=arn:aws:iam::043894507808:policy/graphql-api-dev-fargate-policy]
data.aws_acm_certificate.cert: Refreshing...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=graphql-api-dev-execution-role]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/graphql-api-dev]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:043894507808:cluster/graphql-api-dev]
aws_vpc.vpc: Refreshing state... [id=vpc-03a107da2c461f1ed]
aws_default_vpc.vpc: Refreshing state... [id=vpc-0d6048d87526ca2aa]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment1: Refreshing state... [id=graphql-api-dev-execution-role-20230423033833450400000002]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment2: Refreshing state... [id=graphql-api-dev-execution-role-20230423033833430200000001]
aws_ecs_task_definition.definition: Refreshing state... [id=graphql-api-dev-task]
data.aws_acm_certificate.cert: Refresh complete after 0s [id=arn:aws:acm:us-east-1:043894507808:certificate/bf306bea-c739-451e-bc54-bfd24909b37c]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d8b8f92744a512ba]
aws_security_group.graphql_api: Refreshing state... [id=sg-094dfee2fdebea749]
aws_subnet.subnet["us-east-1b"]: Refreshing state... [id=subnet-08aa670a6d49611ee]
aws_default_security_group.default: Refreshing state... [id=sg-004261418534134d1]
aws_subnet.subnet["us-east-1d"]: Refreshing state... [id=subnet-0484d9eacb0f6cc72]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:targetgroup/graphql-api-dev/8bd964a2078b31fb]
aws_security_group.web_everyone2: Refreshing state... [id=sg-0c52ea438fe27e25e]
aws_vpc_peering_connection.peering_connection: Refreshing state... [id=pcx-01464ec77db02b015]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:loadbalancer/app/graphql-api-dev-alb/83649cc106b45569]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:043894507808:service/graphql-api-dev/graphql-api-dev-svc]
aws_route.vpc_peering_route: Refreshing state... [id=r-rtb-09b02ae3a536a3f7a2811395018]
aws_default_route_table.default: Refreshing state... [id=rtb-010126cd65b1352bc]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:listener/app/graphql-api-dev-alb/83649cc106b45569/9c7828bc7aa6e6a5]
aws_default_vpc.vpc: Drift detected (update)
aws_iam_role.ecs_task_execution_role: Drift detected (update)
aws_ecs_task_definition.definition: Drift detected (update)
aws_lb.alb: Drift detected (update)
aws_iam_policy.fargate_policy: Drift detected (update)
aws_default_route_table.default: Drift detected (update)
aws_subnet.subnet["us-east-1b"]: Drift detected (update)
aws_subnet.subnet["us-east-1d"]: Drift detected (update)
aws_ecs_cluster.cluster: Drift detected (update)
aws_ecs_service.service: Drift detected (update)
aws_lb_listener.listener: Drift detected (update)
aws_security_group.graphql_api: Drift detected (update)
aws_lb_target_group.target_group: Drift detected (update)
aws_cloudwatch_log_group.log_group: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:043894507808:service/graphql-api-dev/graphql-api-dev-svc"
        name                               = "graphql-api-dev-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.definition must be replaced
-/+ resource "aws_ecs_task_definition" "definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:cfdb9a63dd992253a6e627b7f75c9107f6ab9b30" -> "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:3fd7304ffd4630db8fddcae008e72b117e3bce6a"
                    name             = "graphql-api-dev-container"
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "graphql-api-dev-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Environment: `dev`*